Revit 2027 API
DistributionSysType.VoltageLineToLine Property
 Get or set line to line voltage type of distribution system type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public VoltageType VoltageLineToLine { get; set; }
Public Property VoltageLineToLine As VoltageType
	Get
	Set
public:
property VoltageType^ VoltageLineToLine {
	VoltageType^ get ();
	void set (VoltageType^ value);
}
member VoltageLineToLine : VoltageType with get, set
Property Value
VoltageType
Exceptions
Exception | Condition
InvalidOperationException |  The voltage retrieved here is read only and actions to modify its properties it will throw an System.InvalidOperationException.
See Also
Reference
DistributionSysType Class
Autodesk.Revit.DB.Electrical Namespace